tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/cask-versions"
tap "homebrew/core"
tap "homebrew/services"

# Install Brew Packages:

# Get a file from an HTTP, HTTPS or FTP server
brew "curl"
# Collection of GNU find, xargs, and locate
brew "findutils"
# Install some other useful utilities like `sponge`.
brew "moreutils"
# Install GNU `sed` as gsed
brew "gnu-sed"
# GNU grep, egrep and fgrep
brew "grep"
# Software library to render fonts
brew "freetype"
# Cryptography and SSL/TLS Toolkit
brew "openssl@1.1"
# Library for command-line editing
brew "readline"
# High performance, distributed memory object caching system
brew "memcached"
# Python dependency management tool
brew "pipenv"
# Python version management
brew "pyenv"
# Pyenv plugin to manage virtualenv
brew "pyenv-virtualenv"
# Object-relational database system
brew "postgresql", restart_service: true
# Persistent key-value database, with built-in net interface
brew "redis", restart_service: true
# Display directories as trees (with optional color/HTML output)
brew "tree"
# JavaScript package manager
brew "yarn"
# Vi 'workalike' with many additional features
brew "vim"

brew "chezmoi"

# Install MacOS Applications
cask "alfred"
cask "iterm2"
cask "google-chrome"
cask "firefox-developer-edition"
cask "visual-studio-code"
cask "microsoft-teams"
cask "messenger"
cask "discord"
cask "spotify"
cask "vlc"